family_dict = {
('Сидоров', 'Никита'): 35,
('Сидорова', 'Алина'): 34,
('Сидоров', 'Павел'): 10,
('Иванов', 'Максим'): 45,
('Иванова', 'Мария'): 41
}
surname = input("Введите фамилию: ").lower()
if surname[-1] == 'а':
    surname_man = surname[:-1]
    for i_name, i_age in family_dict.items():
        if i_name[0].lower() == surname or i_name[0].lower() == surname_man:
            print(i_name[0], i_name[1], i_age)
else:
    surname_woman = surname + 'а'
    for i_name, i_age in family_dict.items():
        if i_name[0].lower() == surname or i_name[0].lower() == surname_woman:
            print(i_name[0], i_name[1], i_age)

# Сначала хотел решить так, но скорее всего условию задачи больше соответствует верхний код
# family = {
#     'сидоров': {
#         ('Сидоров', 'Никита'): 35,
#         ('Сидорова', 'Алина'): 34,
#         ('Сидоров', 'Павел'): 23,
#     },
#     'сидорова': {
#         ('Сидоров', 'Никита'): 35,
#         ('Сидорова', 'Алина'): 34,
#         ('Сидоров', 'Павел'): 23,
#     },
#     'иванов': {
#         ('Иванов', 'Роман'): 44,
#         ('Иванова', 'Светлана'): 42,
#         ('Иванова', 'Мария'): 24,
#     },
#     'иванова': {
#         ('Иванов', 'Роман'): 44,
#         ('Иванова', 'Светлана'): 42,
#         ('Иванова', 'Мария'): 24,
#     },
#     'ложкин': {
#         ('Ложкина', 'Юлия'): 19,
#         ('Ложкин', 'Сергей'): 52,
#         ('Ложкин', 'Артем'): 22,
#     },
#     'ложкина': {
#         ('Ложкина', 'Юлия'): 19,
#         ('Ложкин', 'Сергей'): 52,
#         ('Ложкин', 'Артем'): 22,
#     }
# }
# user = input('Введите фамилию: ').lower()
# if user not in family:
#     print('Ошибка! Такой семьи нет!')
# else:
#     for value in family[user]:
#         print(' '.join(value), family[user][value])
